{
  "format": "graph-model",
  "generatedBy": "2.3.1",
  "convertedBy": "TensorFlow.js Converter v2.7.0",
  "userDefinedMetadata": {
    "signature": {
      "inputs": {
        "input_1:0": {
          "name": "input_1:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [
              {
                "size": "-1"
              },
              {
                "size": "224"
              },
              {
                "size": "224"
              },
              {
                "size": "3"
              }
            ]
          }
        }
      },
      "outputs": {
        "Identity:0": {
          "name": "Identity:0",
          "dtype": "DT_FLOAT",
          "tensorShape": {
            "dim": [
              {
                "size": "-1"
              },
              {
                "size": "224"
              },
              {
                "size": "224"
              },
              {
                "size": "2"
              }
            ]
          }
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/deeplabv3p/lambda_1/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/lambda/mul/y",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/lambda/sub/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_7_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_7_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_109",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "384"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_7_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_7_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_8_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_8_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_124",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "384"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_8_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_8_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_9_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_9_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_139",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "384"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_9_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_9_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_10_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_10_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_154",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "384"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_10_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_10_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_11_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_11_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_169",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "576"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_11_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_11_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_12_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_12_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_184",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "576"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_12_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_12_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_13_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_13_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_199",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "576"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_13_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_13_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_14_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_14_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_214",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "960"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_14_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_14_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_15_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_15_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "unknown_229",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "960"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_15_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_15_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_16_depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_16_depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unknown_244",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "960"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_16_depthwise/depthwise/BatchToSpaceND/block_shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_16_depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/concatenate/concat/axis",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/lambda_3/resize/size",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "input_1",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "224"
                },
                {
                  "size": "224"
                },
                {
                  "size": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/Conv/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/Conv/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_15_depthwise_BN/FusedBatchNormV3/Offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "960"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_project/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_project/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_1_expand/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "16"
                  },
                  {
                    "size": "96"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_1_expand/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_1_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "96"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_1_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "96"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_1_project/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "96"
                  },
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_14_depthwise_BN/FusedBatchNormV3/Scaled",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "960"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_1_project/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_2_expand/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "24"
                  },
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_2_expand/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_2_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_2_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_2_project/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_14_depthwise_BN/FusedBatchNormV3/Offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "960"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_2_project/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "24"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_3_expand/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "24"
                  },
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_3_expand/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_3_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_3_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "144"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_3_project/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "144"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_3_project/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_4_expand/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "192"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_13_depthwise_BN/FusedBatchNormV3/Scaled",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "576"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/deeplabv3p/expanded_conv_4_expand/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "192"
                  }
                ]
              }
            }
          },
          "dtype": {
